# Шаблоны ответов:

start_message = "Здравствуйте! С моей помощью вы можете связаться с автором канала Понемногу обо всем "\
                "- @abitabouteverything, выразить предложения и пожелания, а также предложить для "\
                "опубликования свои материалы.\n\nОтправьте мне /help для получения помощи по командам."

help_message = "Мои команды:\n/start - Запуск\n/help - Помощь по командам\n"\
               "/feedback - Обратная связь\n/privacy - Политика конфиденциальности\n"

feedback_author_message_1 = "Отправьте мне ответ выбранному человеку в формате:\n\n"\
                          "/answer - <номер-человека-в-списке>:\n<ваш-ответ>.\n"

feedback_author_message_2 = "Нет людей, ожидающих ответа."

feedback_author_message_3 = "Люди, ожидающие ответа:\n\n"

feedback_user_message_1 = "Отправьте мне сообщение, адресованное автору канала. Начните его с команды /feedback."

feedback_user_message_2 = ", ваше сообщение принято. Автор канала ответит на него в ближайшее время.\n\n"\
                          "Пожалуйста, не удаляйте чат со мной. "\
                          "Иначе я не смогу с вами связаться и передать вам ответ автора канала."

answer_author_message = "Ваш ответ отправлен."

answer_user_message_1 = ", автор канала ответил на ваше сообщение:\n"

answer_user_message_2 = "У вас нет прав на выполнение этой команды! "\
                        "Если вы не администратор, то как тогда о ней узнали?"

privacy_message = "Для обеспечения дальнейшей связи с вами будут собраны следующие данные:\n"\
                  "1. ID вашего чата с ботом.\n2. Ваше имя.\n\n"\
                  "Все данные будут использоваться исключительно в вышеописанных целях "\
                  "и будут удалены сразу после того, как вы получите ответ.\n"

default_message = "Не понимаю вас. Пожалуйста, воспользуйтесь помощью по командам /help или подсказками команд."
